examples/inheritgraph/inherit_diamond1.cpp.memlay.dot
digraph memory_layout {

fontname="Helvetica,Arial,sans-serif"
node [fontname="Helvetica,Arial,sans-serif"]
edge [fontname="Helvetica,Arial,sans-serif"]

graph [
    rankdir = "LR"
];
node [
    fontsize = "16"
    shape = "record"
];

ranksep = 2


# items subgraph
{

    "-Abc3" [
        shape=plain
        label=
        <<table border="0" cellborder="1" cellspacing="0" cellpadding="4">
            <tr> <td colspan="3" bgcolor="PaleGreen" port='-1'> <b>::Abc3</b>  (64b)</td> </tr>
            <tr> <td align="right" port='in_0'>0</td> <td align="right">32</td> <td align="left" bgcolor='#FEFECE' port='out_0'>::items::Abc2A</td> </tr>
            <tr> <td align="right" port='in_1'>32</td> <td align="right">32</td> <td align="left" bgcolor='#FEFECE' port='out_1'>::items::Abc2B</td> </tr>
        </table>>
    ]

    "-items-Abc2B" [
        shape=plain
        label=
        <<table border="0" cellborder="1" cellspacing="0" cellpadding="4">
            <tr> <td colspan="3" bgcolor="PaleGreen" port='-1'> <b>::items::Abc2B</b>  (32b)</td> </tr>
            <tr> <td align="right" port='in_0'>0</td> <td align="right">32</td> <td align="left" bgcolor='#FEFECE' port='out_0'>::items::Abc1</td> </tr>
        </table>>
    ]

    "-items-Abc2A" [
        shape=plain
        label=
        <<table border="0" cellborder="1" cellspacing="0" cellpadding="4">
            <tr> <td colspan="3" bgcolor="PaleGreen" port='-1'> <b>::items::Abc2A</b>  (32b)</td> </tr>
            <tr> <td align="right" port='in_0'>0</td> <td align="right">32</td> <td align="left" bgcolor='#FEFECE' port='out_0'>::items::Abc1</td> </tr>
        </table>>
    ]

    "-items-Abc1" [
        shape=plain
        label=
        <<table border="0" cellborder="1" cellspacing="0" cellpadding="4">
            <tr> <td colspan="3" bgcolor="PaleGreen" port='-1'> <b>::items::Abc1</b>  (32b)</td> </tr>
            <tr> <td align="right" port='in_0'>0</td> <td align="right">32</td> <td align="left" port='out_0'>field: int</td> </tr>
        </table>>
    ]


    "-Abc3":"out_0" -> "-items-Abc2A":"-1"
    "-Abc3":"out_1" -> "-items-Abc2B":"-1"
    "-items-Abc2B":"out_0" -> "-items-Abc1":"-1"
    "-items-Abc2A":"out_0" -> "-items-Abc1":"-1"

}  # end of items subgraph

}  # end of graph
